import React from 'react';
import Links from '../CreatingComponents/Links/Links';
import './Method.css';
import navImage from '../../assets/images/logoimages/navImage.png';
import { GlobalPaths } from '../../Services/GlobalPaths';

function Method(): JSX.Element {
    return (
        <div className="Method p-col-12 p-md-11 p-lg-12">
            <section>
                <p>
                    מזה WoolFit?
                    WoolFit הינה שיטת אימון שאני מפתח כבר כמה חודשים.
                    מעל 20 שנה שאני עוסק בהמון תחומים שונים של ספורט תחרותי ומאתגר
                    כגון: כדורסל, כדורגל, אתלטיקה, נינגה, קליסטניק (משקלי גוף), סוגי הגלישה למיניהם ועוד המון סוגי ספורט שונים
                    ומהנים החלטתי ללמוד קורס מדריכי כושר בקמפוס שיאים .
                    את הקורס סיימתי בדצמבר 2019 בהצטיינות.
                </p>
                <p>
                    לאחר שלמדתי את עקרונות האימון והכושר הגופני הבסיסיים , החלטתי לשלב בין עולמות הספורט שאני חובב לבין עקרונות
                    הכושר שלמדתי ובכך לפתח שיטת אימון חדשנית שהופכת את האימון הכושר הרגיל שאתם מכירים לאימון מאתגר מהנה ומשפר
                    יותר.
                </p>
                <p>
                    למה משפר? ככל שהגוף שלכם והשרירים שלכם יזוזו ויפעלו בצורות שונות והתנגדויות שונות
                    אנחנו נגרה את היחידות המוטוריות בשרירים יותר מכל אימון רגיל , נפתח קורדינאציה תוך ובין שרירית , נשרוף קלוריות
                    נשפר את הכושר האירובי שלנו – וכמובן נהנה מהדרך.
                </p>
                <p>
                    היא פונה לקהל הרחב – מילדים נשים גברים עם ובלי נסיון ספורטיבי אשר מעוניינים
                    ,מאתגרת ומשפרת הרבה יותר.
                    מה בתוכנית?
                    באימונים נשמור נקפיד על הטכניקה ונשלב את כל עקרונות הכושר הגופניים עם נגיעות מעולמות הכושר השונים ,
                    משקל גוף - עמידות ידיים , קליסטניק ונינגה
                    יציבה וליבה חזקים – בעזרת תרגילים מגוונים מעולמות שונים נשפר את השווי משקל היציבות ושרירי הליבה .
                    ניגע ונשלב את עולם הכדורים – כדורגל , כדורסל , טניס בעזרתם נשפר את הקורדינציה ונשלב עוד המון תרגילים בנאלים
                    שיהפכו למאתגרים ומהנים הרבה יותר.
                </p>
            </section>
            <div className="navBars">
                <Links src={navImage} route={GlobalPaths.videoLinkUrl} content={"מדיה"} />
                <Links src={navImage} route={GlobalPaths.trainersLinkUrl} content={"מורקים"} />
            </div>
        </div>
    )
}

export default Method;